## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [48]:
# Your code here - remember to use markdown cells for comments as well!

import os,glob
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [49]:
folder = "/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/"
os.listdir(folder)
#/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project
#folder = "../../../Projects/dsc-phase-1-project/zippedData/"

['imdb.title.crew.csv.gz',
 'tmdb.movies.csv.gz',
 'imdb.title.akas.csv.gz',
 'imdb.title.ratings.csv.gz',
 'imdb.name.basics.csv.gz',
 'rt.reviews.tsv.gz',
 'imdb.title.basics.csv.gz',
 'rt.movie_info.tsv.gz',
 'tn.movie_budgets.csv.gz',
 'bom.movie_gross.csv.gz',
 'imdb.title.principals.csv.gz']

In [50]:
f"{folder}*.csv*"

'/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/*.csv*'

In [51]:
files = glob.glob(f"{folder}*.csv*")

In [52]:
files[0].replace('.csv.gz','').split('/')[-1].replace('.','_')

'imdb_title_crew'

In [53]:
tables = {}
dashes='---'*25

for file in files:
    ## Save a variable-friendly version of the file name
    table_name = file.replace('.csv.gz','').split('/')[-1].replace('.','_')
    print(dashes)
    
    ## Load and preview dataframe
    print(f"Preview of {table_name}")
    tables[table_name] = pd.read_csv(file)
    display(tables[table_name].head(5))
    print()

---------------------------------------------------------------------------
Preview of imdb_title_crew

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

---------------------------------------------------------------------------
Preview of tmdb_movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

---------------------------------------------------------------------------
Preview of imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

---------------------------------------------------------------------------
Preview of imdb_title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

---------------------------------------------------------------------------
Preview of imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

---------------------------------------------------------------------------
Preview of imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

---------------------------------------------------------------------------
Preview of tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

---------------------------------------------------------------------------
Preview of bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

---------------------------------------------------------------------------
Preview of imdb_title_principals

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

Trying to get the merge between movies and directors

In [54]:
name_titles = imdb_name_basics.merge(imdb_title_principals, how='left', on='nconst')
name_titles.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,tconst,ordering,category,job,characters
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553",tt2398241,9.0,producer,producer,NaN
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940",tt0433397,7.0,composer,NaN,NaN
2,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940",tt1681372,8.0,composer,NaN,NaN
3,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940",tt2387710,8.0,composer,NaN,NaN
4,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940",tt2281215,7.0,composer,NaN,NaN

In [55]:
names_movies = imdb_title_akas.merge(name_titles, how='inner', left_on='title_id', right_on='tconst')
names_movies.head()

,title_id,ordering_x,title,region,language,types,attributes,is_original_title,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles,tconst,ordering_y,category,job,characters
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0,nm0000341,Michael Crichton,1942.0,2008.0,"writer,producer,director","tt0070909,tt0117998,tt0108757,tt0107290",tt0369610,9.0,writer,based on the characters created by,NaN
1,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0,nm0339460,Judy Greer,1975.0,NaN,"actress,producer,soundtrack","tt0369610,tt0337563,tt0478970,tt0988595",tt0369610,4.0,actress,NaN,"[""Karen""]"
2,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0,nm0695435,Chris Pratt,1979.0,NaN,"actor,soundtrack,producer","tt1490017,tt0369610,tt1266020,tt2015381",tt0369610,1.0,actor,NaN,"[""Owen""]"
3,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0,nm0397171,Bryce Dallas Howard,1981.0,NaN,"actress,director,writer","tt1454029,tt0369610,tt1800302",tt0369610,2.0,actress,NaN,"[""Claire""]"
4,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0,nm0798646,Amanda Silver,1963.0,NaN,"writer,producer,actress","tt2103281,tt1318514,tt0369610,tt3450958",tt0369610,7.0,writer,screenplay by,NaN

In [56]:
names_movies = names_movies[names_movies['category'] == 'director']
names_movies.head()
len(names_movies)

348492

In [57]:
names_movies = names_movies.drop_duplicates(subset=['title', 'primary_name'])
len(names_movies)

278818

In [58]:
names_movies.isna().sum()

title_id                   0
ordering_x                 0
title                      0
region                 34838
language              241333
types                 143957
attributes            264370
is_original_title          0
nconst                     0
primary_name               0
birth_year            171115
death_year            276408
primary_profession       188
known_for_titles        1119
tconst                     0
ordering_y                 0
category                   0
job                   268247
characters            278818
dtype: int64

In [59]:
budgets_direct1 = tn_movie_budgets.merge(names_movies, how='inner', left_on='movie', right_on='title')

In [60]:
budgets_direct1.head()
budgets_direct1 = budgets_direct1.drop_duplicates(subset='movie')

In [61]:
budgets_direct1

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,title_id,ordering_x,title,region,...,primary_name,birth_year,death_year,primary_profession,known_for_titles,tconst,ordering_y,category,job,characters
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",tt1775309,2,Avatar,XWW,...,Atsushi Wada,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",tt1775309,5.0,director,NaN,NaN
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",tt1298650,14,Pirates of the Caribbean: On Stranger Tides,US,...,Rob Marshall,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",tt1298650,5.0,director,NaN,NaN
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",tt6565702,16,Dark Phoenix,US,...,Simon Kinberg,1973.0,NaN,"producer,writer,director","tt1502712,tt3315342,tt1877832,tt3659388",tt6565702,5.0,director,NaN,NaN
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",tt2395427,15,Avengers: Age of Ultron,US,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",tt2395427,5.0,director,NaN,NaN
4,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,10,Avengers: Infinity War,AR,...,Joe Russo,1971.0,NaN,"producer,director,writer","tt4154756,tt4154796,tt1843866,tt3498820",tt4154756,6.0,director,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4272,62,"Dec 31, 2014",Stories of Our Lives,"$15,000",$0,$0,tt3973612,2,Stories of Our Lives,NaN,...,Jim Chuchu,NaN,NaN,"director,writer,editor","tt5978462,tt4429758,tt3328782,tt3973612",tt3973612,5.0,director,NaN,NaN
4273,67,"Apr 28, 2006",Clean,"$10,000","$138,711","$138,711",tt6619196,1,Clean,CA,...,Graham Wright,NaN,NaN,"soundtrack,director,actor","tt7192674,tt1230155,tt6619196,tt1195478",tt6619196,5.0,director,NaN,NaN
4274,68,"Jul 6, 2001",Cure,"$10,000","$94,596","$94,596",tt2027234,1,Cure,US,...,Zach Grimshaw,NaN,NaN,"director,actor","tt8528742,tt2027234",tt2027234,2.0,director,co-director,NaN
4280,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0,tt7837402,1,Red 11,NaN,...,Robert Rodriguez,1968.0,NaN,"producer,writer,director","tt1077258,tt0104815,tt0287717,tt0458481",tt7837402,5.0,director,NaN,NaN
4281,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0,tt2107644,1,A Plague So Pleasant,US,...,Benjamin Roberds,NaN,NaN,"camera_department,director,writer",tt2107644,tt2107644,4.0,director,NaN,NaN

In [62]:
budgets_direct1['year'] = budgets_direct1['release_date'].map(lambda x: x[-4:])

In [63]:
budgets_direct1['year'] = budgets_direct1['year'].astype('int')

In [64]:
budgets_direct1 = budgets_direct1[budgets_direct1['year'] > 2000]

In [79]:
budgets_direct1 = budgets_direct1[budgets_direct1['production_budget'] > 20000000]

TypeError: '>' not supported between instances of 'str' and 'int'

In [80]:
grouped3 = budgets_direct1.groupby('primary_name')[['production_budget','domestic_gross', 'worldwide_gross']].mean()
grouped3 = grouped3[grouped3['domestic_gross']>300000000]
grouped3 = grouped3.reset_index()
grouped3.head()

DataError: No numeric types to aggregate

In [ ]:
grouped4 = budgets_direct1.groupby('primary_name')[['production_budget','domestic_gross', 'worldwide_gross']].sum()
grouped4 = grouped4[grouped4['domestic_gross']>500000000]
grouped4 = grouped4.reset_index()
len(grouped4)

In [ ]:
fig, (ax1, ax2) = plt.subplots(figsize= (13,5), nrows=1, ncols=2)

ax1 = sns.barplot(data=grouped3, x='domestic_gross', y='primary_name', palette='flare', ax=ax1)
ax1.set_title('Top Directors by Average Domestic Gross')
ax1.set_xlabel('Domestic Gross ($ hundreds of millions)')
ax1.set_ylabel('Director')

ax2 = sns.barplot(data=grouped4, x='domestic_gross', y='primary_name', palette='flare', ax=ax2)
ax2.set_title('Top Directors by Total Domestic Gross')
ax2.set_xlabel('Domestic Gross ($ billions)')
ax2.set_ylabel('Director')



fig.tight_layout()

## Work on turning the groupby into an easy function

### quick description of each file: where I see value

imdb_title_crew - value if I can see how directors/writers are linked to movies

tmdb_movies - nothing really here, maybe genre_ids

imdb_title_akas - needed to join to IMDB base because title_id

imdb_title_ratings - not necessary

imdb_name_basics - can weed out directors/known for can use for movies and then join

imdb_title_basics - useful for runtime and genres

tn_movie_budgets - good for release date (seasons) and profit margin

bom_movie_gross - ^ is superior

imdb_title_principals - can use to figure out director/actor/producer. might be better than imdb_name_basics

In [81]:
filepath0 = files[0]
imdb_title_crew = pd.read_csv(filepath0)
imdb_title_crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [83]:
filepath1 = files[1]
tmdb_movies = pd.read_csv(filepath1)
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [84]:
filepath2 = files[2]
imdb_title_akas = pd.read_csv(filepath2)
imdb_title_akas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [85]:
filepath3 = files[3]
imdb_title_ratings = pd.read_csv(filepath3)
imdb_title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [86]:
filepath4 = files[4]
imdb_name_basics = pd.read_csv(filepath4)
imdb_name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [87]:
filepath5 = files[5]
imdb_title_basics = pd.read_csv(filepath5)
imdb_title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [88]:
filepath6 = files[6]
tn_movie_budgets = pd.read_csv(filepath6)
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [89]:
filepath7 = files[7]
bom_movie_gross = pd.read_csv(filepath7)
bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [90]:
filepath8 = files[8]
imdb_title_principals = pd.read_csv(filepath8)
imdb_title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

- Observe that tconst denotes an ID of the title, which links to imdb_title_principals
- Can perform inner join here to determine the actor/director of specified films
- Observe that tconst denotes ID of person, which links imdb_title_principals to imdb_name_basics

In [91]:
# Link category (role) to primary_name (name)

role_name = imdb_title_principals.merge(imdb_name_basics, how='inner', on = 'nconst')

In [92]:
role_name.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940"
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181"

In [93]:
# Link role_name to movie titles using t_const thru imdb_title_basics showing primary_titles

name_role_movie = role_name.merge(imdb_title_basics, on='tconst', how='left')

In [94]:
name_role_movie.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"

In [95]:
movie_directors = name_role_movie.loc[name_role_movie['category'] == 'director']

In [96]:
movie_directors.loc[movie_directors['primary_name']=='James Cameron']

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
143644,tt1757678,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 3,Avatar 3,2023,NaN,"Action,Adventure,Drama"
143645,tt1630029,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 2,Avatar 2,2021,NaN,"Action,Adventure,Fantasy"
143646,tt3095356,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
143652,tt5637536,5,nm0000116,director,NaN,NaN,James Cameron,1954.0,NaN,"writer,producer,director","tt0499549,tt0120338,tt0103064,tt0090605",Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"

In [97]:
# merge tn movie budgets to view who the director of each film is. seems to work outside of Avatar

In [98]:
budgets_directors = tn_movie_budgets.merge(movie_directors, left_on = 'movie', right_on = 'primary_title', how='inner')

In [99]:
budgets_directors.head(25)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",tt1775309,5,nm3786927,director,...,Atsushi Wada,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",tt1298650,5,nm0551128,director,...,Rob Marshall,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",tt6565702,5,nm1334526,director,...,Simon Kinberg,1973.0,NaN,"producer,writer,director","tt1502712,tt3315342,tt1877832,tt3659388",Dark Phoenix,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",tt2395427,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi"
4,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,5,nm0751577,director,...,Anthony Russo,1970.0,NaN,"producer,director,writer","tt1843866,tt4154756,tt3498820,tt4154796",Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"
5,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,6,nm0751648,director,...,Joe Russo,1971.0,NaN,"producer,director,writer","tt4154756,tt4154796,tt1843866,tt3498820",Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"
6,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209",tt0974015,5,nm0811583,director,...,Zack Snyder,1966.0,NaN,"producer,director,writer","tt0770828,tt0451279,tt0409459,tt0416449",Justice League,Justice League,2017,120.0,"Action,Adventure,Fantasy"
7,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923",tt2379713,5,nm0005222,director,...,Sam Mendes,1965.0,NaN,"producer,director,miscellaneous","tt0959337,tt1074638,tt0257044,tt0169547",Spectre,Spectre,2015,148.0,"Action,Adventure,Thriller"
8,11,"Jul 20, 2012",The Dark Knight Rises,"$275,000,000","$448,139,099","$1,084,439,099",tt1345836,5,nm0634240,director,...,Christopher Nolan,1970.0,NaN,"writer,producer,director","tt0482571,tt1375666,tt5013056,tt0154506",The Dark Knight Rises,The Dark Knight Rises,2012,164.0,"Action,Thriller"
9,12,"May 25, 2018",Solo: A Star Wars Story,"$275,000,000","$213,767,512","$393,151,347",tt3778644,5,nm0000165,director,...,Ron Howard,1954.0,NaN,"actor,producer,director","tt0112384,tt0268978,tt0367279,tt0870111",Solo: A Star Wars Story,Solo: A Star Wars Story,2018,135.0,"Action,Adventure,Fantasy"
10,13,"Jul 2, 2013",The Lone Ranger,"$275,000,000","$89,302,115","$260,002,115",tt1210819,5,nm0893659,director,...,Gore Verbinski,1964.0,NaN,"director,producer,writer","tt4731136,tt0325980,tt1192628,tt1210819",The Lone Ranger,The Lone Ranger,2013,150.0,"Action,Adventure,Western"
11,14,"Mar 9, 2012",John Carter,"$275,000,000","$73,058,679","$282,778,100",tt0401729,5,nm0004056,director,...,Andrew Stanton,1965.0,NaN,"writer,actor,producer","tt0120623,tt0266543,tt2277860,tt0910970",John Carter,John Carter,2012,132.0,"Action,Adventure,Sci-Fi"
12,15,"Nov 24, 2010",Tangled,"$260,000,000","$200,821,936","$586,477,240",tt0398286,5,nm1977355,director,...,Nathan Greno,1975.0,NaN,"actor,art_department,director","tt2112281,tt0396555,tt0398286,tt2245084",Tangled,Tangled,2010,100.0,"Adventure,Animation,Comedy"
13,15,"Nov 24, 2010",Tangled,"$260,000,000","$200,821,936","$586,477,240",tt0398286,6,nm0397174,director,...,Byron Howard,1968.0,NaN,"animation_department,director,actor","tt0398286,tt0328880,tt2948356,tt0397892",Tangled,Tangled,2010,100.0,"Adventure,Animation,Comedy"
14,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349","$1,140,069,413",tt3498820,5,nm0751577,director,...,Anthony Russo,1970.0,NaN,"producer,director,writer","tt1843866,tt4154756,tt3498820,tt4154796",Captain America: Civil War,Captain America: Civil War,2016,147.0,"Action,Adventure,Sci-Fi"
15,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349","$1,140,069,413",tt3498820,6,nm0751648,director,...,Joe Russo,1971.0,NaN,"producer,director,writer","tt4154756,tt4154796,tt1843866,tt3498820",Captain America: Civil War,Captain America: Civil War,2016,147.0,"Action,Adventure,Sci-Fi"
16,18,"Mar 25, 2016",Batman v Superman: Dawn of Justice,"$250,000,000","$330,360,194","$867,500,281",tt2975590,5,nm0811583,director,...,Zack Snyder,1966.0,NaN,"producer,director,writer","tt0770828,tt0451279,tt0409459,tt0416449",Batman v Superman: Dawn of Justice,Batman v Superman: Dawn of Justice,2016,151.0,"Action,Adventure,Fantasy"
17,19,"Dec 14, 2012",The Hobbit: An Unexpected Journey,"$250,000,000","$303,003,568","$1,017,003,568",tt0903624,5,nm0001392,director,...,Peter Jackson,1961.0,NaN,"producer,director,writer","tt0167260,tt0092610,tt0120737,tt0360717",The Hobbit: An Unexpected Journey,The Hobbit: An Unexpected Journey,2012,169.0,"Adventure,Family,Fantasy"
18,21,"Dec 13, 2013",The Hobbit: The Desolation of Smaug,"$250,000,000","$258,366,855","$960,366,855",tt1170358,5,nm0001392,director,...,Peter Jackson,1961.0,NaN,"producer,director,writer","tt0167260,tt0092610,tt0120737,tt0360717",The Hobbit: The Desolation of Smaug,The Hobbit: The Desolation of Smaug,2013,161.0,"Adventure,Fantasy"
19,22,"Dec 17, 2014",The Hobbit: The Battle of the Five Armies,"$250,000,000","$255,119,788","$945,577,621",tt2310332,5,nm0001392,director,...,Peter Jackson,1961.0,NaN,"producer,director,writer","tt0167260,tt0092610,tt0120737,tt0360717",The Hobbit: The Battle of the Five Armies,The Hobbit: The Battle of the Five Armies,2014,144.0,"Adventure,Fantasy"
20,23,"Apr 14, 2017",The Fate of the Furious,"$250,000,000","$225,764,765","$1,234,846,267",tt4630562,5,nm0336620,director,...,F. Gary Gray,1969.0,NaN,"director,actor,producer","tt0120768,tt0117603,tt0113118,tt0317740",The Fate of the Furious,The Fate of the Furious,2017,136.0,"Action,Crime,Thriller"
21,25,"May 26, 2017",Pirates of the Caribbean: Dead Men Tell No Tales,"$230,000,000","$172,558,876","$788,241,137",tt1790809,5,nm1461392,director,...,Joachim Rønning,1972.0,NaN,"director,writer,producer","tt1613750,tt1029235,tt1790809",Pirates of the Caribbean: Dead Men Tell No Tales,Pirates of the Caribbean: Dead Men Tell No Tales,2017,129.0,"Action,Adventure,Fantasy"
22,25,"May 26, 2017",Pirates of the Caribbean: Dead Men Tell No Tales,"$230,000,000","$172,558,876","$788,241,137",tt1790809,6,nm1650283,director,...,Espen Sandberg,1971.0,NaN,"director,producer,executive","tt1790809,tt0416496,tt1613750,tt1029235",Pirates of the Caribbean: Dead Men Tell No Tales,Pirates of the Caribbean: Dead Men Tell No Tales,2017,129.0,"Action,Adventure,Fantasy"
23,27,"May 4, 2012",The Avengers,"$225,000,000","$623,279,547","$1,517,935,897",tt0848228,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",The Avengers,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi"
24,35,"Aug 14, 1998",The Avengers,"$60,000,000","$23,385,416","$48,585,416",tt0848228,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",The Avengers,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi"

In [103]:
# # Turn Production budget, domestic gross, worldwide gross into numeric values
budgets_directors['production_budget'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

0       425000000
1       410600000
2       350000000
3       330600000
4       300000000
          ...
3864        10000
3865        10000
3866         7000
3867         1400
3868         1400
Name: production_budget, Length: 3869, dtype: int64

In [104]:

budgets_directors['domestic_gross'] = budgets_directors['domestic_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [105]:
budgets_directors['worldwide_gross'] = budgets_directors['worldwide_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [106]:
budgets_directors.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,1,"Dec 18, 2009",Avatar,"$425,000,000",760507625,2776345279,tt1775309,5,nm3786927,director,...,Atsushi Wada,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875,1045663875,tt1298650,5,nm0551128,director,...,Rob Marshall,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000",42762350,149762350,tt6565702,5,nm1334526,director,...,Simon Kinberg,1973.0,NaN,"producer,writer,director","tt1502712,tt3315342,tt1877832,tt3659388",Dark Phoenix,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000",459005868,1403013963,tt2395427,5,nm0923736,director,...,Joss Whedon,1964.0,NaN,"writer,producer,director","tt0118276,tt0162065,tt0848228,tt1259521",Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi"
4,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000",678815482,2048134200,tt4154756,5,nm0751577,director,...,Anthony Russo,1970.0,NaN,"producer,director,writer","tt1843866,tt4154756,tt3498820,tt4154796",Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"

In [ ]:
# # Change columns to reflect $
# budgets_directors.rename(columns={'production_budget': 'Production_Budget_$', 'domestic_gross': 'Domestic_Gross_$', 'worldwide_gross': 'WorldWide_Gross_$'}, inplace=True)

In [ ]:
# Start pulling out outliers from data set

https://www.marketwatch.com/story/netflix-reportedly-set-to-produce-90-movies-a-year-with-budgets-up-to-200-million-2018-12-16

Sweetspot between $20 million - $200 million
Will remove movies below $20 million from data set. Use this bound for analysis

In [ ]:
# budgets_directors = budgets_directors.loc[budgets_directors['Production_Budget_$'] > 20000000]

Our data-set now contains 1,634 films, all contains budgets in excess of $20 million

In [ ]:
# budgets_directors['Production_Budget_$'].head(20).sort_values().plot(kind='barh')

In [ ]:
# # Create column to represent profit-margin, which will be our indicator for success

# budgets_directors['Profit_Margin'] = budgets_directors['WorldWide_Gross_$'] / budgets_directors['Production_Budget_$']

In [ ]:
# bd_dropped = budgets_directors.drop_duplicates(subset= 'id', keep='first')

In [ ]:
# bd_dropped.release_date.unique()

In [ ]:
len(tn_movie_budgets)

In [ ]:
tn_movie_budgets.head()

In [ ]:
#Parsing through the duplicates on the movie columns are remakes. No duplicates when using movie & release date subset
tn_movie_budgets[tn_movie_budgets.duplicated(subset=['movie', 'release_date'])]

In [ ]:
tn_movie_budgets['production_budget'] = tn_movie_budgets['production_budget'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
tn_movie_budgets['domestic_gross'] = tn_movie_budgets['domestic_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
tn_movie_budgets['worldwide_gross'] = tn_movie_budgets['worldwide_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
len(tn_movie_budgets)

In [ ]:
big_budget = tn_movie_budgets.loc[tn_movie_budgets['production_budget'] > 20000000]

In [ ]:
big_budget.head()

In [ ]:
big_budget_2 = big_budget.copy()

In [ ]:
big_budget_2

In [ ]:
big_budget_2['month'] = big_budget_2['release_date'].map(lambda x: x[0:3])

In [ ]:
big_budget_2

In [ ]:
month_map = {'Jan':1, 'Feb':2, 'Mar':3, 'Apr':4, 'May':5, 'Jun': 6, 'Jul': 7, 'Aug': 8, 'Sep': 9, 'Oct': 10, 'Nov':11, 'Dec':12}

In [ ]:
big_budget_2['month_num'] = big_budget_2['month'].map(month_map)

In [ ]:
grouped = big_budget_2.groupby('month_num')[['worldwide_gross','domestic_gross']].mean()

In [ ]:
grouped.plot(kind='bar')

In [ ]:
grouped.head()

In [ ]:
grouped['worldwide_gross']
grouped.reset_index()

In [ ]:
t_labels = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
grouped.plot(kind='bar')
plt.ylabel('Profit $')
plt.xlabel('Month')
plt.set_xticklabels(x)

In [ ]:
import seaborn as sns
fig, ax = plt.subplots(figsize=(10,5))
fig.set_facecolor("lightgrey")
ax = sns.barplot(x='month_num', y="worldwide_gross", data=big_budget_2, color='mediumorchid', ci=None, label='Worldwide Gross')
ax = sns.barplot(x='month_num', y="domestic_gross", data=big_budget_2, color='violet', ci=None, label= 'Domestic Gross')
ax.legend()
ax.set_xlabel('Month', color='black')
ax.set_ylabel('Worldwide Gross ($ hundreds of millions)')
ax.set_title('Movie Gross by Month')

t_labels = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
ax.set_xticklabels(t_labels)
#fig.savefig("/Users/ethankunin/Documents/movie_month.png")

In [ ]:
#maybe can try and figure out how to get a cleaner merge. For now move on with budgets directors

t_rt = big_budget.merge(imdb_title_basics, left_on='movie', right_on='primary_title', how='left')

t_rt.info()

In [ ]:
run_time = budgets_directors.copy()

In [ ]:
run_time.isna().sum()

In [ ]:
# Chop out low-budget (20 million) films

In [ ]:
run_time.head()

In [ ]:
run_time['production_budget'] = run_time['production_budget'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
run_time = run_time[run_time['production_budget'] > 20000000]

In [ ]:
# Find median/mean

run_time.agg({'runtime_minutes' : ['mean', 'median']})

In [ ]:
budgets_directors['runtime_minutes'] = budgets_directors['runtime_minutes'].fillna(budgets_directors['runtime_minutes'].median())

In [ ]:
budgets_directors.isna().sum()

In [ ]:
t_rt2 = run_time.merge(budgets_directors, left_on='movie', right_on='movie', how='left')
t_rt2.head()

In [ ]:
t2cols = t_rt2.columns
t2cols = ['id_x','tconst_x', 'ordering_x',
       'nconst_x', 'category_x', 'job_x', 'characters_x', 'primary_name_x',
       'birth_year_x', 'death_year_x', 'primary_profession_x',
       'known_for_titles_x', 'primary_title_x', 'original_title_x',
       'start_year_x', 'id_y',
       'release_date_y', 'production_budget_y', 'domestic_gross_y',
       'worldwide_gross_y', 'tconst_y', 'ordering_y', 'nconst_y', 'category_y',
       'job_y', 'characters_y', 'primary_name_y', 'birth_year_y',
       'death_year_y', 'primary_profession_y', 'known_for_titles_y',
       'primary_title_y', 'original_title_y', 'start_year_y', 'runtime_minutes_x']

In [ ]:
t_rt2.drop(columns= ['id_x','tconst_x', 'ordering_x',
       'nconst_x', 'category_x', 'job_x', 'characters_x', 'primary_name_x',
       'birth_year_x', 'death_year_x', 'primary_profession_x',
       'known_for_titles_x', 'primary_title_x', 'original_title_x',
       'start_year_x', 'id_y',
       'release_date_y', 'production_budget_y', 'domestic_gross_y',
       'worldwide_gross_y', 'tconst_y', 'ordering_y', 'nconst_y', 'category_y',
       'job_y', 'characters_y', 'primary_name_y', 'birth_year_y',
       'death_year_y', 'primary_profession_y', 'known_for_titles_y',
       'primary_title_y', 'original_title_y', 'start_year_y', 'runtime_minutes_x', 'genres_x'], inplace=True)

In [ ]:
t_rt2 = t_rt2.rename(columns={'release_date_x': 'release_date', 'production_budget_x': 'production_budget', 'domestic_gross_x': 'domestic_gross', 'worldwide_gross_x': 'worldwide_gross', 'runtime_minutes_y': 'runtime_minutes', 'genres_y': 'genres'})

In [ ]:
t_rt2.head()

In [ ]:
len(t_rt2)

In [ ]:
t_rt2 = t_rt2[t_rt2['production_budget'] > 20000000]

In [ ]:
t_rt2.drop_duplicates(subset=['release_date', 'movie'], keep='first', inplace=True)

Have dropped duplicates, have runtime and movie lined up, need to make a cool graph to show either linear relationship between time and worldwide gross. Must change gross to int. Possibly scatter plot grouped by 10 min intervals. Use a function to design this. Only show worldwide gross

In [ ]:
len(t_rt2)

In [ ]:
t_rt2.info()

In [ ]:
t_rt2['domestic_gross'] = t_rt2['domestic_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
t_rt2['worldwide_gross'] = t_rt2['worldwide_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
t_rt2.info()

In [ ]:
t_rt2.head()

In [ ]:
# Remove movies below 90 mins

In [ ]:
length_m = t_rt2[(t_rt2['runtime_minutes'] > 90) & (t_rt2['runtime_minutes'] < 180)]

In [ ]:
len(length_m)

In [ ]:
length_m.isna().sum()

In [ ]:
def length(mins):
    if mins < 120:
        return 'short'
    elif mins < 150:
        return 'medium'
    else:
        return 'long'

In [ ]:
length_m['duration'] = length_m['runtime_minutes'].map(length)

In [ ]:
length_m.head()

In [ ]:
fig, ax = plt.subplots(figsize=(8, 6))
ax = sns.boxplot(x='duration', y='worldwide_gross', data=length_m)
ax.set_ylim(0, 1500000000)
ax.set_title('Movie Gross Based on Duration')
ax.set_ylabel('Worldwide Gross ($ hundreds of millions)')
ax.set_xlabel('Duration')

x_labs = ['90-120 mins', '120-150 mins', '150-180 mins']
ax.set_xticklabels(x_labs)
#fig.savefig("/Users/ethankunin/Documents/box_plot_by_duration.png");

In [ ]:
fig, ax = plt.subplots(figsize=(8, 6))
ax = sns.regplot(x='runtime_minutes', y='worldwide_gross', data=length_m)

ax.set_title('Movie Gross Based on Duration')
ax.set_ylabel('Worldwide Gross ($ hundreds of millions)')
ax.set_xlabel('Minutes')
ax.axvline(x=120, color='cornflowerblue', linestyle='solid', label='short', alpha=0.5)
ax.axvline(x=150, color='cornflowerblue', linestyle='solid', label='medium', alpha=0.5)
ax.legend()
#fig.savefig("/Users/ethankunin/Documents/lin_reg_minutes.png")

;

Create graph to show seasonal success

In [ ]:
big_budget_2.info()

In [ ]:
big_budget_2.head()

In [ ]:
def seasons(month):
    if (month >= 3) & (month <= 5):
        return 'Spring'
    elif (month >= 6) & (month <=8):
        return 'Summer'
    elif (month >= 9) & (month <=11):
        return 'Fall'
    else:
        return 'Winter'
    
    
    
    
seasons(3)

In [ ]:
big_budget_2['Season'] = big_budget_2['month_num'].map(seasons)

In [ ]:
big_budget_2.head(20)

In [ ]:
fig, ax = plt.subplots(figsize=(8, 6))
ax = sns.boxplot(x='Season', y='worldwide_gross', data=big_budget_2)
ax.set_ylim(0, 700000000)
ax.set_title('Movie Gross Based on Season')
ax.set_ylabel('Worldwide Gross ($ hundreds of millions)')
ax.set_xlabel('Season')

Create dictionary of the 200 top grossing films directos

In [ ]:
budgets_directors.head()

In [ ]:
budgets_directors2 = budgets_directors.copy()

In [ ]:
budgets_directors2.head()

In [ ]:
budgets_directors2['worldwide_gross'] = budgets_directors2['worldwide_gross'].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')

In [ ]:
budgets_directors2.info()

In [ ]:
hp_dirs = budgets_directors2.loc[budgets_directors2['worldwide_gross']> 100000000]

In [ ]:
len(hp_dirs)

In [ ]:
dir_ws = hp_dirs.groupby('primary_name')['worldwide_gross'].sum()

###  Directors List (WWG > 1800000000)

In [ ]:
len(dir_ws[dir_ws > 1800000000])

### Start building out genre recommendation

In [ ]:
t_rt2.info()

In [ ]:
t_rt3 = t_rt2.copy()

In [ ]:
t_rt3.groupby('genres')['worldwide_gross'].agg(['median', 'mean'])

In [ ]:
## Testing function

In [ ]:
budgets_directors.head()

In [ ]:
def col_to_int(df, colm):
    df[colm] = df[colm].map(lambda x: x.replace('$', '')).map(lambda x: x.replace(',', '')).astype('int')
    return df

In [ ]:
budgets_directors4 = budgets_directors.copy()

In [ ]:
col_to_int(budgets_directors4, 'domestic_gross')

In [ ]:
tester5 = 'Dec 18, 2009'
tester5[-4:]

In [ ]:
import matplotlib as mpl
ax.style.context('ggplot')

In [ ]:
fig, ax = plt.subplots(figsize=(8, 6))
ax = sns.boxplot(x='Season', y='worldwide_gross', data=big_budget_2)
ax.set_ylim(0, 700000000)
ax.set_title('Movie Gross Based on Season')
ax.set_ylabel('Worldwide Gross ($ hundreds of millions)')
ax.set_xlabel('Season')

In [109]:
budgets_directors5 = budgets_directors.copy()

In [111]:
budgets_directors5.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,1,"Dec 18, 2009",Avatar,"$425,000,000",760507625,2776345279,tt1775309,5,nm3786927,director,...,Atsushi Wada,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875,1045663875,tt1298650,5,nm0551128,director,...,Rob Marshall,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy"

In [112]:
budgets_directors5['profit'] = budgets_directors5['worldwide_gross'] - budgets_directors5['domestic_gross']

In [114]:
budgets_directors5.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres,profit
0,1,"Dec 18, 2009",Avatar,"$425,000,000",760507625,2776345279,tt1775309,5,nm3786927,director,...,NaN,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror,2015837654
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875,1045663875,tt1298650,5,nm0551128,director,...,1960.0,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy",804600000

In [115]:
def profitable(num):
    if num > 0:
        return True
    else:
        False

In [116]:
budgets_directors5['ptf'] = budgets_directors5['profit'].map(profitable)

In [117]:
budgets_directors5.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres,profit,ptf
0,1,"Dec 18, 2009",Avatar,"$425,000,000",760507625,2776345279,tt1775309,5,nm3786927,director,...,NaN,director,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror,2015837654,True
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875,1045663875,tt1298650,5,nm0551128,director,...,NaN,"director,miscellaneous,producer","tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy",804600000,True

In [122]:
budgets_directors5['pmarg (%)'] = (budgets_directors5['worldwide_gross'] / budgets_directors5['domestic_gross']) *100

In [123]:
budgets_directors5.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,ordering,nconst,category,...,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres,profit,ptf,pmarg,pmarg (%)
0,1,"Dec 18, 2009",Avatar,"$425,000,000",760507625,2776345279,tt1775309,5,nm3786927,director,...,"tt1594549,tt1775309,tt1602612",Avatar,Abatâ,2011,93.0,Horror,2015837654,True,365.064753,365.064753
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875,1045663875,tt1298650,5,nm0551128,director,...,"tt2180411,tt0299658,tt0875034,tt5028340",Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy",804600000,True,433.770458,433.770458